src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade2.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
    xmlns:fpml="http://www.fpml.org/2010/FpML-4-9"  xmlns:rm="OTC_RM_11-0"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapIndex</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001234"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">810RI27100804CP</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181008.0004086555</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00005678"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">810RI27100803</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181008.0004086555</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">1030229152</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">IL196459337</USITradeId>
                    </USI>
                    <OriginatingUSI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier"/>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier"/>
                    </OriginatingUSI>
                </TradeMsg>
                <MsgId>MSERV20181008.0004086555</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>MarkitSERV</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.markitserv.net</RouteAddress>
                        <ReceiveTime>2018-10-08T05:57:52.137-05:00</ReceiveTime>
                        <ReleaseTime>2018-10-08T05:58:02.456-05:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                       xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					   http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                       xsi:type="RequestTradeConfirmation">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20181008.0004086555</messageId>
                        <sentBy>DTCC00001234</sentBy>
                        <sendTo>DTCC00005678</sendTo>
                        <creationTimestamp>2018-10-08T10:58:02.462Z</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader
                            xmlns="http://www.fpml.org/2010/FpML-4-9">
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00001234"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">810RI27100804CP</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181008.0004086555</fpml:tradeId>
                            </partyTradeIdentifier>
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00005678"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">810RI27100803</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181008.0004086555</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2018-07-17</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwapOption>
                            <buyerPartyReference href="DTCC00001234"/>
                            <sellerPartyReference href="DTCC00005678"/>
                            <optionType>Put</optionType>
                            <premium>
                                <payerPartyReference href="DTCC00001234"/>
                                <receiverPartyReference href="DTCC00005678"/>
                                <paymentAmount>
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">EUR</currency>
                                    <amount>137437.50000</amount>
                                </paymentAmount>
                                <paymentDate>
                                    <adjustableDate>
                                        <unadjustedDate>2018-07-20</unadjustedDate>
                                        <dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </dateAdjustments>
                                    </adjustableDate>
                                </paymentDate>
                            </premium>
                            <europeanExercise>
                                <expirationDate>
                                    <adjustableDate>
                                        <unadjustedDate>2018-09-19</unadjustedDate>
                                        <dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </dateAdjustments>
                                    </adjustableDate>
                                </expirationDate>
                                <earliestExerciseTime>
                                    <hourMinuteTime>00:00:00</hourMinuteTime>
                                    <businessCenter>NONE</businessCenter>
                                </earliestExerciseTime>
                                <expirationTime>
                                    <hourMinuteTime>23:00:00</hourMinuteTime>
                                    <businessCenter>NONE</businessCenter>
                                </expirationTime>
                            </europeanExercise>
                            <exerciseProcedure>
                                <manualExercise/>
                                <followUpConfirmation>true</followUpConfirmation>
                            </exerciseProcedure>
                            <settlementType>Physical</settlementType>
                            <strike>
                                <spread>0.0003000</spread>
                            </strike>
                            <creditDefaultSwap>
                                <generalTerms>
                                    <effectiveDate>
                                        <fpml:unadjustedDate>2018-03-20</fpml:unadjustedDate>
                                        <fpml:dateAdjustments>
                                            <fpml:businessDayConvention>NotApplicable</fpml:businessDayConvention>
                                        </fpml:dateAdjustments>
                                    </effectiveDate>
                                    <scheduledTerminationDate>
                                        <fpml:adjustableDate>
                                            <fpml:unadjustedDate>2023-06-20</fpml:unadjustedDate>
                                            <fpml:dateAdjustments>
                                                <businessDayConvention>NotApplicable</businessDayConvention>
                                            </fpml:dateAdjustments>
                                        </fpml:adjustableDate>
                                    </scheduledTerminationDate>
                                    <sellerPartyReference href="DTCC00005678"/>
                                    <buyerPartyReference href="DTCC00001234"/>
                                    <indexReferenceInformation>
                                        <fpml:indexName indexNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">ITRAXX EUROPE CROSSOVER SERIES 29 VERSION 1</fpml:indexName>
                                        <fpml:indexId indexIdScheme="http://www.fpml.org/spec/2003/instrument-id-RED-pair">2I667KFN3</fpml:indexId>
                                    </indexReferenceInformation>
                                </generalTerms>
                                <feeLeg>
                                    <periodicPayment>
                                        <fixedAmountCalculation>
                                            <fixedRate>0.0500000000</fixedRate>
                                        </fixedAmountCalculation>
                                    </periodicPayment>
                                </feeLeg>
                                <protectionTerms>
                                    <calculationAmount id="calculationAmount">
                                        <currency currencyScheme="http://www.fpml.org/ext/iso4217">EUR</currency>
                                        <amount>15000000.00000</amount>
                                    </calculationAmount>
                                </protectionTerms>
                            </creditDefaultSwap>
                        </creditDefaultSwapOption>
                        <calculationAgent>
                            <calculationAgentPartyReference href="DTCC00005678"/>
                        </calculationAgent>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">2002</masterAgreementVersion>
                                <masterAgreementDate>2006-05-01</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2014Credit</contractualDefinitions>
                            <contractualTermsSupplement>
                                <type contractualSupplementScheme="http://www.fpml.org/coding-scheme/contractual-supplement">iTraxxEurope</type>
                                <publicationDate>2014-09-20</publicationDate>
                            </contractualTermsSupplement>
                            <contractualTermsSupplement>
                                <type contractualSupplementScheme="http://www.fpml.org/ext/swaption-supplement">iTraxxEuropeSwaption</type>
                                <publicationDate>2017-03-20</publicationDate>
                            </contractualTermsSupplement>
                        </documentation>
                    </trade>
                    <party id="DTCC00001234">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00001234</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCCZBUT11V806EZRVTWT807</fpml:partyId>
                    </party>
                    <party id="DTCC00005678">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00005678</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCC7H6GLXDRUGQFU57RNE97</fpml:partyId>
                    </party>
                </FpML>
            </Trade>
            <WorkflowData>
                <partyReference href="DTCC00005678"/>
                <PartyWorkflowFields>
                    <comment>MSGID-999d63ed-4a36-40a9-9d9b-0f88b276d7b4</comment>
                    <designatedParty>JPMCB-NY-CR PORTFOLI</designatedParty>
                    <branchLocation>NEW YORK</branchLocation>
                </PartyWorkflowFields>
            </WorkflowData>
        </OTC_Matching>
    </env:Body>
</env:Envelope>